In [ ]:
from config.db import getConnection
import pandas as pd

In [3]:
#Connecting with database
conn = getConnection()

In [4]:
# Getting clubs
query_clubes = "SELECT * FROM cartola.clubes"
clubes = pd.read_sql(query_clubes, conn)
clubes.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\1691405254.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  clubes = pd.read_sql(query_clubes, conn)

   clube_id nome abreviacao         slug          apelido nome_fantasia
0         1  OUT        OUT                                      Outros
1       262  FLA        FLA     flamengo           Mengão      Flamengo
2       263  BOT        BOT     botafogo         Glorioso      Botafogo
3       264  COR        COR  corinthians            Timão   Corinthians
4       265  BAH        BAH        bahia  Tricolor de Aço         Bahia

In [5]:
query_posicoes = "SELECT * FROM cartola.posicoes"
posicoes = pd.read_sql(query_posicoes, conn)
posicoes.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\1731277171.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  posicoes = pd.read_sql(query_posicoes, conn)

   posicao_id      nome abreviacao
0           1   Goleiro        gol
1           2   Lateral        lat
2           3  Zagueiro        zag
3           4      Meia        mei
4           5  Atacante        ata

In [6]:
query_scouts = "SELECT * FROM cartola.scouts"
scouts = pd.read_sql(query_scouts, conn)
scouts.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\2560286167.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  scouts = pd.read_sql(query_scouts, conn)

   id                   nome abreviacao  pontos observacao
0   1                    Gol          G     8.0
1   2            Assistência          A     5.0
2   3   Finalização na trave         FT     3.0
3   4  Finalização defendida         FD     1.2
4   5   Finalização pra fora         FF     0.8

In [7]:
query_rodadas = "SELECT * FROM cartola.rodadas"
rodadas = pd.read_sql(query_rodadas, conn)
rodadas.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\2058869999.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  rodadas = pd.read_sql(query_rodadas, conn)

   rodada_id nome_rodada              inicio                 fim
0          1    Rodada 1 2025-03-29 18:30:00 2025-03-31 20:00:00
1          2    Rodada 2 2025-04-05 18:30:00 2025-04-06 20:30:00
2          3    Rodada 3 2025-04-12 16:00:00 2025-04-13 20:30:00
3          4    Rodada 4 2025-04-16 18:30:00 2025-04-17 21:30:00
4          5    Rodada 5 2025-04-19 16:00:00 2025-04-21 20:00:00

In [8]:
query_status = "SELECT * FROM cartola.status"
status = pd.read_sql(query_status, conn)
status.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\486490424.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  status = pd.read_sql(query_status, conn)

   status_id        nome
0          2      Dúvida
1          3    Suspenso
2          5  Contundido
3          6        Nulo
4          7    Provável

In [9]:
query_partidas_historico = "SELECT * FROM cartola.partidas_historico"
partidas_historico = pd.read_sql(query_partidas_historico, conn)
partidas_historico.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\4142430073.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  partidas_historico = pd.read_sql(query_partidas_historico, conn)

,id,local,clube_mandante_id,clube_visitante_id,placar_mandante,placar_visitante,clube_mandante_posicao,clube_visitante_posicao,aproveitamento_mandante,aproveitamento_visitante,rodada_id
0,1,Morumbis,276,292,0,0,11,20,"['e', 'e', 'v', 'e', 'e']","['d', 'd', 'd', 'e', 'd']",1
1,2,Mineirão,283,2305,2,1,4,16,"['e', 'v', 'd', 'v', 'v']","['e', 'v', 'e', 'e', 'd']",1
2,3,Arena do Grêmio,284,282,2,1,13,10,"['d', 'd', 'e', 'e', 'v']","['e', 'd', 'v', 'e', 'v']",1
3,4,Castelão (CE),356,266,2,0,17,5,"['e', 'd', 'd', 'e', 'e']","['v', 'v', 'e', 'd', 'v']",1
4,5,Alfredo Jaconi,286,287,2,0,15,18,"['v', 'd', 'e', 'd', 'd']","['e', 'v', 'e', 'e', 'd']",1

In [10]:
query_atleta_pontuacao = "SELECT * FROM cartola.atleta_pontuacao"
atleta_pontuacao = pd.read_sql(query_atleta_pontuacao, conn)
atleta_pontuacao.head()

C:\Users\Josef\AppData\Local\Temp\ipykernel_7396\3859137925.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  atleta_pontuacao = pd.read_sql(query_atleta_pontuacao, conn)

,pontuacao_id,apelido,atleta_id,pontuacao,posicao_id,clube_id,rodada_id,entrou_em_campo,scouts
0,1,Yuri Alberto,100652,2.9,5,264,1,1,"{""FD"": 2, ""FS"": 1}"
1,2,Matheus Henrique,100742,-1.9,4,283,1,1,"{""CA"": 1, ""FC"": 3}"
2,3,Lucas Esteves,100846,2.8,2,284,1,1,"{""DS"": 1, ""FF"": 1, ""FS"": 1}"
3,4,Vitinho,100898,10.7,2,263,1,1,"{""DS"": 4, ""FC"": 1, ""SG"": 1}"
4,5,Ronald Lopes,100969,-1.1,4,287,1,1,"{""CA"": 1, ""FC"": 2, ""FS"": 1}"